## Aufgaben der ersten Vorlesung

**Aufgabe 1**

- https://aijobs.net
- Die Datenquelle zeigt verschiedene Stellenausschreibungen in den Bereichen AI, Machine Learning, Data Analytics, etc.
- Firmen können ihre Ausschreibungen hier veröffentlichen und verlinken ihre eigene Webseite/Kontaktmöglichkeiten
- Die Webseite wird in der Schweiz gehostet und muss sich daher an strikte Datenschutzvorgaben halten, zusätzlich ist die Webseite sehr transparent mit  allen Prozessen
-> Die Daten wirken sehr verlässlich!

**Aufgabe 2**

In [97]:
import csv
import pandas as pd

In [105]:
print("Die ersten fünf Zeilen des Datensatzes")
df = pd.read_csv('data.csv')
display(df.head())

Die ersten fünf Zeilen des Datensatzes

,job_title,experience_level,employment_type,work_models,work_year,employee_residence,salary,salary_currency,salary_in_usd,company_location,company_size
0,Data Engineer,Mid-level,Full-time,Remote,2024,United States,148100,USD,148100,United States,Medium
1,Data Engineer,Mid-level,Full-time,Remote,2024,United States,98700,USD,98700,United States,Medium
2,Data Scientist,Senior-level,Full-time,Remote,2024,United States,140032,USD,140032,United States,Medium
3,Data Scientist,Senior-level,Full-time,Remote,2024,United States,100022,USD,100022,United States,Medium
4,BI Developer,Mid-level,Full-time,On-site,2024,United States,120000,USD,120000,United States,Medium

In [89]:
print("Die Daten enthalten {} Zeilen und {} Spalten".format(df.shape[0], df.shape[1]))

Die Daten enthalten 6599 Zeilen und 11 Spalten

In [103]:
vars= df.columns
print("Fehlende Daten:")
df[vars].isnull().sum()

Fehlende Daten:

job_title             0
experience_level      0
employment_type       0
work_models           0
work_year             0
employee_residence    0
salary                0
salary_currency       0
salary_in_usd         0
company_location      0
company_size          0
dtype: int64

**Aufgabe 3**

In [104]:
def median_new(t):
    new = t['salary_in_usd'].median()
    return round(new, 0)
def mean_new(t):
    new = t['salary_in_usd'].mean()
    return round(new, 0)

df_el = df[df['experience_level'] == "Entry-level"]
df_ml = df[df['experience_level'] == "Mid-level"]
df_sl = df[df['experience_level'] == "Senior-level"]
df_exl = df[df['experience_level'] == "Executive-level"]

dfn = pd.DataFrame(
    {'Median': [median_new(df), median_new(df_el), median_new(df_ml), median_new(df_sl), median_new(df_exl)],
     'Mittelwert': [mean_new(df), mean_new(df_el), mean_new(df_ml), mean_new(df_sl), mean_new(df_exl)]},
     index=['Gesamt','Entry-Level', 'Mid-Level', 'Senior-Level', 'Executive-Level'])
display(dfn)

                   Median  Mittelwert
Gesamt           138666.0    145561.0
Entry-Level       75000.0     84449.0
Mid-Level        106500.0    119020.0
Senior-Level     153600.0    162071.0
Executive-Level  184560.0    189687.0